import { Invoke } from '@renderer/core/ipc'
import { External } from '@preload/external'

export const StartUpTips: string[] = [
  'also try vivid/otto!',
  '这么强？？？',
  'a-text: v-model=f**ker',
  '回滚到pre5——',
  'stray/vivify v2欢迎你！',
  '今天改了多少bug。不知道，多出来很多……',
  '早上是晚上的第二天，晚上是早上。',
  'A.R.K载体。可惜的是……',
  '今天回家！明天不回！',
  'npm run dev',
  '[vite] connection lost...',
  '[vue warn] Shit chart detected',
  '我草卡输入法了',
  'Felleta::stray-vivify',
  'int mian() {}',
  '#include &lt;stray.h&gt;',
  'No detours, no detours',
  'FPS: N/A',
  'chart.diff.fuck_shown()',
  'ultradash > J S > >',
  '卡 车 丢 失',
  'also try Rotaeno!',
  '不是，我很好奇到底为什么会写这个。这不就纯纯私货大杂烩吗，那我更新这个list的意义何在？我说原神牛B，但是我不玩原神（其实55级了）；我说明日方舟是区，但是还是高高兴兴地给小马宝莉爆了24块钱和3*18个源石。我提笔（？）写下这一段文字，却发现自己钱包空空，坐在电脑前两眼无神地看着sv的源代码然后感到“我草我写的什么东西”。这是开发者必备的一环吗？我不知道。你可以点击上方sv图标来刷新tips如果这个实在太长挡住了你的视线，但是如果你没有开sv图标显示你就不能刷掉因为我没有粘贴一个v-on到div.su-title上面（转手就去加上了因为小孩害怕被人挂了，你这不是纯有病吗），不喜欢这个图标的人我确实不能拿你怎么样但是它会老老实实吃掉你95.27kB的内存而且如果我没记错沟槽的electron-builder会把这个东西打包两次所以你会被吃掉95.27x2=_____kB的存储空间。你可以删掉它但是我不高兴了，我会往你的sv里面植入病毒然后拿你的电脑内存开一个Gray:Heaven服务器，盗走你电脑上所有的百合图片让你晚上对着只余滚木的图片文件夹大哭大闹，然后自动在你的电脑上下载明日方舟（终末地不熟，垃圾游戏）（这一句话纯属我真不喜欢这个游戏，你可以喜欢终末地但不要试图劝说我要喜欢终末地，如果你不喜欢敬请点击上面的图标刷新tips）PC端并自动启动获得11.45秒的生存时间。我一直好奇会认真看这个tips的人都是什么成分，玩蔚蓝吗（怎么有张雪峰照片）（句读之不知）？其实我是个弱弱萌新1A都要死一百次，2A至今还是只能靠assist才能通过。加拿大病毒不会感染我因为我压根学不会凌波微步所以我不想玩蔚蓝（羡慕手法大佬）。至于隔壁1999，别问了我现在只会露西+苏芙比剩下随便放一个人然后就干等露西开出大来，对单我直接死。我肯定不擅长玩音游，也没有特别大的热情玩音游，你看我玩了5年阿卡伊但是只有12.4，现在不过是甲亢reg4的水平。为什么要打音游？闲得慌？倒不如拿起我的中二手台开一把狂End Time然后睡大觉，我说rin是神（以及推荐循幻空的手台，还是做的不错的，如果你没钱买抬手乐）。梦见哪句写哪句，我真的不想做sv更新了因为我知道每次更新一边修bug然后就会蹦出新的bug所以我还是会被骂至于莫名其妙的白屏我真的不知道electron抽什么风我也很难解决所以我推荐出现诸如此类滚木提示大问题影响到你正常写噗的话请联系我看看F12然后我已急哭地去看这又是哪里溢出了导致vue罢工或者因为这个字符串太长导致你的sv爆掉了但是这个和图片比起来难道不是图片才是区吗因为你看一个文件用掉了一万MB的内存但是这个字符串什么都不会用掉只会在你的Memory.String里面肆无忌惮地拉史不管你看不看这个tip都是一样的因为这是全量编译加载的什么你问我能不能不要这么做那我只能说你也不想让你的sv拥有一个比命长的启动进度条吧所以我能怎么办呢（笑）。',
  '有很多时候，我对sv这个项目会感到迷茫。<br>当然，我（TerminalFlow）现在自然已经不再是sv整个项目的一员，所有的社区什么都和我几乎没有关系了。写谱我也没写过，比赛我又太菜。所以终于感到自己做了那么多何意味的事情，乃至于会有人要求要一个新的社区。自然，sv是开源的，也不限制分发啊使用啊什么的，其实也没那么多顾虑。也许我只是觉得水群很舒服，所以总是希望水群的时候有人能鸟我一下。（但是我的水群技巧又可谓一坨，诸位也大概不太喜欢理我吧……）总而言之，只是我过多把个人情感带到群里面，但是这并不是一个适合我讲个人情感的地方。我想回归我自己的生活，所谓为自己而活。<br>你看到的这一个tip，应该是1.0.1加进来的。自从0.9.8那时我大概宣布了不会再进行开发。不过之后我还是在慢慢地写代码，修bug之类的……对吧。我从来没有做过什么可谓完美的版本（唯一一个我愿意称之为几乎的是pre5，在另一个tips你也看得见我对这个版本的执念还是很深的），所以sv一直在成长的路上，对吧？<br>作为创始人吧（略微摆下架子），24年底当我刚刚入坑没多久，在别的群讨论arc自制时，被invalid data激发了下灵感（所以也很感谢他！）（也要说道“红是谁”锦年，大家都不认识我就不做展开，也很感谢他！），于是有了sv的第一个版本。那时还使用的是div里直接套img的形式，这种架构在build 4左右遇到了非常严重的卡顿问题。于是后来我们换成了svg渲染（这个可能叫做v2，在0.6附近），这个直到0.9.9才改为现在的canvas/pixi.js渲染的形式。v7之后一直存在各种各样的延迟问题，大家基本都在各种被音乐延迟卡顿给气笑了。在1.0.0里merge了Creeper的修复，我希望这个能够帮助大家。<br>sv本身的开发如上，充满了艰难险阻和神秘乐趣和bug。比如在注释里我时常感叹自己小学音乐课上没有好好学乐理，导致节拍的分音和*每小节多少拍*一直有些算不明白。还有各种各样的fuck内容，贯穿全部的是fuck-shown，也就是设置里的note分组（aka pooling）。这个命名也许不是个笑话，对吧。。。？<br>我觉得很少有人会看tips。看到这？感谢你，接下来我想聊聊对几个群u的印象吧，他们在我心理还挺重要的。<br>HarbingerLeo。其实我记得他主要内容是因为他也玩宝宝巴士（，当然还有Hileznx（头像可爱捏）也是，大家经常每周四开始锐评私募小金又更了什么内容。<br>Ivusz。可能打错了吧，抱歉，我写这个的时候我只记得ivz了。和reagain关系很好吧？（笑）是很厉害的ranker哦。有天赋的，也勤练，加油加油，希望明年svc还有出席！<br>McIron，唯一一个线下和我见过面的群友。他提出了Reform插件的要求，这是1.0.1的主要更新之一。当然现在端上来了。那一日我们在KFC。其实我也挺开心的，他也鼓励了我很多。很好玩哦。我这四年也在这边，欢迎再来找我玩哦。<br>白巧。有点绷的是最早一会我们sv还在几个主群被禁的，因为自制还没有大面积铺开。是很可爱的大哥哥哦，被195草饲了（？）想念进worldkeeper的那个时候，进群一群人开始草窝，我说我185你们草不动我，白巧雷霆入场把我草飞（笑）。这也是一年多前的事情了。之后我也加入（和离开）了汉化组。白巧好。我觉得自制社区也少不了他啊。<br>InvalidData。这个肯定是你群我最信任的（没有之一）人。我也把群主给他了，这是我情绪崩溃期间他给我的解决方法。他也是你群和我认识最早的人。后来我们也很多一起干活（比如方向盘），也很喜欢在食堂聊天。这个项目到这里也要尤其感谢他哦。<br>……还有很多，我记不起来了。Credits里的每一个人我都很感谢哦。也很感谢你看到这里，或者说感谢每一个你。<br>',
  'JT8-3，启动！',
  '我过reg4啦！'
]

export async function load_external_tips() {
  const r = await Invoke('read-external', { fname: 'startup-tips.json' })
  if (!r) {
    console.log('Read External: startup-tips failed')
    return
  }
  StartUpTips.push(...(JSON.parse(r) as External.StartUpTips))
  console.log('Read External: startup-tips')
}
